var test = [
  ["1", "", "", ""],
  ["2", "", "", ""],
  ["3", "", "", ""],
  ["4", "", "", ""],
  ["5", "", "", ""],
  ["6", "", "", ""],
  ["7", "", "", ""],
  ["8", "", "", ""],
  ["9", "", "", ""],
  ["10", "", "", ""],
];

export const dataList = [
  {
    columns: [
      {
        title: "排名",
        width: 40,
        isRank: true,
      },
      {
        title: "姓名",
        width: 40,
      },
      {
        title: "综合热度",
        width: 40,
      },
      {
        title: "代表作",
        width: 80,
      },
    ],
    data: [
      ["1", "肖战", "87.1", "藏海传"],
      ["2", "成毅", "85.0", "赴山海"],
      ["3", "刘宇宁", "84.9", "折腰"],
      ["4", "王一博", "84.4", "探索新境：向岩而生"],
      ["5", "檀健次", "84.2", "震耳欲聋"],
      ["6", "王鹤棣", "84.0", "大奉打更人"],
      ["7", "张凌赫", "83.6", "爱你"],
      ["8", "龚俊", "82.8", "暗河传"],
      ["9", "周深", "82.7", "奔跑吧9</br>2025「深深的」巡回演唱会"],
      ["10", "易烊千玺", "82.6", "小小的我"],
    ],
  },
  {
    columns: [
      {
        title: "排名",
        width: 40,
        isRank: true,
      },
      {
        title: "姓名",
        width: 60,
      },
      {
        title: "综合热度",
        width: 40,
      },
      {
        title: "代表作",
        width: 80,
      },
    ],
    data: [
      ["1", "杨幂", " 88.1 ", "生万物"],
      ["2", "赵丽颖", " 87.8 ", "在人间"],
      ["3", "杨紫", " 87.5 ", "国色芳华"],
      ["4", "赵露思", " 87.3 ", "许我耀眼"],
      ["5", "迪丽热巴", " 85.9 ", "利剑玫瑰"],
      ["6", "白鹿", " 84.2 ", "临江仙"],
      ["7", "虞书欣", " 84.1 ", "嘘，国王在冬眠"],
      ["8", "刘亦菲", " 83.0 ", "玫瑰的故事"],
      ["9", "唐嫣", " 82.0 ", "念奴双"],
      ["10", "刘诗诗", " 81.8 ", "淮水竹亭"],
    ],
  },
  {
    columns: [
      {
        title: "排名",
        width: 40,
        isRank: true,
      },
      {
        title: "姓名",
        width: 60,
      },
      {
        title: "潜力指数",
        width: 60,
      },
      {
        title: "代表作",
        width: 60,
      },
    ],
    data: [
      ["1", "梓渝", "88.5 ", "逆爱"],
      ["2", "田栩宁", "88.3", "逆爱"],
      ["3", "颜安", "84.4 ", "相思令"],
      ["4", "张康乐", "82.7 ", "锦月如歌"],
      ["5", "敖瑞鹏", "80.1 ", "朝雪录"],
      ["6", "李昀锐", "78.7 ", "宴遇永安"],
      ["7", "余承恩", "78.1 ", "朝雪录"],
      ["8", "辛云来", "77.4 ", "雁回时"],
      ["9", "全伊伦", "77.0", "入青云"],
      ["10", "陈鹤一", "75.8 ", "五福临门"],
    ],
  },
  {
    columns: [
      {
        title: "排名",
        width: 40,
        isRank: true,
      },
      {
        title: "姓名",
        width: 60,
      },
      {
        title: "潜力指数",
        width: 60,
      },
      {
        title: "代表作",
        width: 60,
      },
    ],
    data: [
      ["1", "田曦薇", " 72.6 ", "大奉打更人"],
      ["2", "章若楠", " 71.8 ", "难哄"],
      ["3", "单依纯", " 71.5 ", "歌手2025"],
      ["4", "吴宣仪", " 70.2 ", "乘风2025"],
      ["5", "李兰迪", " 69.5 ", "朝雪录"],
      ["6", "宋祖儿", " 69.4 ", "折腰"],
      ["7", "代露娃", " 68.8 ", "白月梵星"],
      ["8", "徐艺洋", " 66.7 ", "半熟恋人4"],
      ["9", "王玉雯", " 65.9 ", "地球超新鲜"],
      ["10", "张艺凡", " 65.2 ", "7天"],
    ],
  },
  {
    columns: [
      {
        title: "排名",
        width: 40,
        isRank: true,
      },
      {
        title: "姓名",
        width: 40,
      },
      {
        title: "综合价值",
        width: 40,
      },
      {
        title: "线下音乐演出",
        width: 100,
      },
    ],
    data: [
      ["1", "时代少年团", " 88.4", "时代少年团「加冠礼」演唱会"],
      ["2", "王源", "87.7", "王源2025宇宙超级无敌</br>大狂欢巡回演唱会"],
      ["3", "周深", "87.4", "周深2025「深深的」</br>巡回演唱会"],
      ["4", "刘宇宁", "87.0", "「刘宇宁的」2025巡演"],
      ["5", "华晨宇", "86.9", "2025华晨宇火星演唱会"],
      ["6", "汪苏泷", "85.1", "汪苏泷2025演唱会</br>「十万伏特2.0」"],
      ["7", "易烊千玺", "85.1", "易烊千玺2025演唱会「礐嶨」"],
      ["8", "张杰", "83.6", "2025张杰未·LIVE—</br>「开往1982」世界巡回演唱会"],
      ["9", "张艺兴", "83.5", "2025张艺兴「大航海5·美猴王</br>闹天宫」巡回演唱会"],
      ["10", "邓紫棋", "82.3", "G.E.M.邓紫棋 2025 </br>I AM GLORIA世界巡回演唱会2.0"],
    ],
  },
  {
    columns: [
      {
        title: "排名",
        width: 40,
        isRank: true,
      },
      {
        title: "姓名",
        width: 60,
      },
      {
        title: "热度指数",
        width: 40,
      },
      {
        title: "代表作",
        width: 100,
      },
    ],
    data: [
      ["1", "李子柒", " 93.6 ", "传统文化类短视频"],
      ["2", "papi酱", "86.8 ", "日常生活吐槽系列"],
      ["3", "潘天鸿（Tim）", "85.3 ", "数码视频"],
      ["4", "Mrbeast</br>野兽先生", "83.9", "挑战类短视频"],
      ["5", "董宇辉", "82.3 ", "知识+带货"],
      ["6", "老师好我叫何同学", "80.5 ", "数码视频"],
      ["7", "房琪", "79.8 ", "旅行类原创短视频"],
      ["8", "无穷小亮的科普日常", "79.0 ", "网络热传生物鉴定系列"],
      ["9", "江寻千", "78.7 ", "美食、文化、非遗短视频原创博主"],
      ["10", "食贫道", "75.2 ", "《人间喜剧》栏目"],
    ],
  },
  {
    columns: [
      {
        title: "排名",
        width: 40,
        isRank: true,
      },
      {
        title: "姓名",
        width: 40,
      },
      {
        title: "热度指数",
        width: 40,
      },
      {
        title: "代表作",
        width: 110,
      },
    ],
    data: [
      ["1", "柯淳", " 98.1", "好一个乖乖女"],
      ["2", "李柯以", "92.1", "十八岁太奶奶驾到，重整家族荣耀"],
      ["3", "曾辉", "89.8", "南音再许"],
      ["4", "韩雨彤", "89.4", "月光锈"],
      ["5", "刘念", "89.1", "请君入我怀"],
      ["6", "余茵", "88.6", "好一个乖乖女"],
      ["7", "郭宇欣", "87.5", "盛夏芬德拉"],
      ["8", "刘萧旭", "86.3", "盛夏芬德拉"],
      ["9", "何聪睿", "85.5", "请君入我怀"],
      ["10", "王培延", "85.4", "十八岁太奶奶驾到，重整家族荣耀"],
    ],
  },
  {
    columns: [
      {
        title: "排名",
        width: 40,
        isRank: true,
      },
      {
        title: "姓名",
        width: 60,
      },
      {
        title: "出自游戏",
        width: 60,
      },
      {
        title: "代表作",
        width: 60,
      },
    ],
    data: [
      ["1", "祁煜", " 恋与深空", "99.5"],
      ["2", "沈星回", "恋与深空", "99.4"],
      ["3", "秦彻", "恋与深空", "99.3"],
      ["4", "夏以昼", "恋与深空", "96.8"],
      ["5", "黎深", "恋与深空", "96.7"],
      ["6", "齐司礼", "光与夜之恋", "89.7"],
      ["7", "陆沉", "光与夜之恋", "89.6"],
      ["8", "萧逸", "光与夜之恋", "89.4"],
      ["9", "查理苏", "光与夜之恋", "86.4"],
      ["10", "夏鸣星", "光与夜之恋", "83.7"],
    ],
  },
];

export const chartOptions = [];
